УТ/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
</mdclass:Enum>

УТ/src/Enums/СтавкиНДС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет ставки НДС, операции, отраженные по которым, подлежат регистрации в книге продаж.
//
// Параметры:
//   Параметры - Структура - параметры для определения ставок
//     * ВерсияПостановленияНДС1137 - Число - см. УчетНДСПереопределяемый.ВерсияПостановленияНДС1137.
//
// Возвращаемое значение:
//   Массив - ставки НДС

Функция СтавкиПоОперациямОтражаемымВКнигеПродаж(ВерсияПостановленияНДС1137) Экспорт
	
	МассивСтавок = Новый Массив;
	
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС0);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС5);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС5_105);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС7);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС7_107);
	
	Если ВерсияПостановленияНДС1137 < 3 Тогда
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.БезНДС);
	КонецЕсли;
	
	Возврат МассивСтавок;

	
КонецФункции


#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если Параметры.Свойство("ИсключатьДробныеСтавки") И Параметры.ИсключатьДробныеСтавки Тогда
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС10_110);
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС18_118);
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоДробныеСтавки") И Параметры.ТолькоДробныеСтавки Тогда
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.БезНДС);
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС0);
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС10);
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС18);
		МассивИсключаемыхЗначений.Добавить(Перечисления.СтавкиНДС.НДС20);
	КонецЕсли;
	
	Если МассивИсключаемыхЗначений.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияУТВызовСервера.ДоступныеДляВыбораЗначенияПеречисления(
			"СтавкиНДС",
			ДанныеВыбора,
			Параметры,
			МассивИсключаемыхЗначений);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
